       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTPRG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY CUSTOMER.

       PROCEDURE DIVISION.

           MOVE 10001 TO CUSTOMER-ID
           MOVE 'JOHN SMITH' TO CUSTOMER-NAME
           MOVE 1500.75 TO CUSTOMER-BALANCE

           DISPLAY 'CUSTOMER ID     : ' CUSTOMER-ID
           DISPLAY 'CUSTOMER NAME   : ' CUSTOMER-NAME
           DISPLAY 'CUSTOMER BALANCE: ' CUSTOMER-BALANCE

           STOP RUN.
